frontend/controllers/SiteController.php

    public function actionProfile()
    {
        if (!Yii::$app->user->isGuest) {
            $user = User::findIdentity(Yii::$app->user->id);
            $user->setOnline();
        }

        $model = ($model = Profile::findOne(['user_id' => Yii::$app->user->id]))
            ? $model : new Profile();
        $file = ($file = Files::findOne(['id' => $model->avatar]))
            ? $file : new Files();
        if ($model->load(Yii::$app->request->post()) && $model->validate() &&
            $file->load(Yii::$app->request->post()) && $file->validate()
        ) {
            $file->file = UploadedFile::getInstance($file, 'file');
            if (isset($file->file)) {
                if ($file->file->extension != 'png'
                    && $file->file->extension != 'jpg' && $file->file->extension != 'jpeg'
                ) {
                    Yii::$app->session->setFlash('error', 'Файл должен иметь расширение *.png, *.jpg или *.jpeg .');
                    return $this->render('profile', [
                        'model' => $model,
                        'file' => $file,
                    ]);
                } else {
                    if (isset($model->avatar)) {
                        unlink($model->getAvatar()->one()->path);
---
SELECT * FROM `profile` WHERE `user_id`=2
SELECT * FROM `files` WHERE `id`=42
SELECT * FROM `files` WHERE `id`=53