frontend/controllers/UsersController.php

    public function actionUser()
    {
        if (!Yii::$app->user->isGuest) {
            $user = User::findIdentity(Yii::$app->user->id);
            $user->setOnline();
        }

        $model = User::findOne(['id' => Yii::$app->request->get('id')]);
---
SELECT * FROM `user` WHERE `id`='1'