frontend/controllers/WorldController.php

    public function actionEdit()
    {
        if (!Yii::$app->user->isGuest) {
            $user = User::findIdentity(Yii::$app->user->id);
            $user->setOnline();
        }

        $model = ($model = World::findOne(['id' => Yii::$app->request->get('id')]))
            ? $model : new World();

        if ($model->status === World::STATUS_DELETED) {
            Yii::$app->session->setFlash('warning', 'Данный мир удален.');
            return $this->redirect('/gurps/frontend/web/index.php/site/index');
        }

        $file = ($file = Files::findOne(['id' => $model->file_id]))
            ? $file : new Files();

        if ($model->load(Yii::$app->request->post()) && $model->validate() &&
            $file->load(Yii::$app->request->post()) && $file->validate()
        ) {
---
SELECT * FROM `world` WHERE `id`='28'
SELECT * FROM `files` WHERE `id` IS NULL
SELECT * FROM `world` WHERE (`id` IS NULL) AND (`status`=10)