frontend/views/users/user.php

SELECT * FROM `profile` WHERE `user_id`=1
---
/* @var $form ActiveForm */


$this->title = $model->getProfile()->one()->name;

SELECT * FROM `profile` WHERE `user_id`=1
---
            <div class="rows">
                <div class="col-lg-5">
                    <?php
                    if (isset($model->getProfile()->one()->getAvatar()->one()->path)) {
                        echo '<img src="/' . $model->getProfile()->one()->getAvatar()->one()->path .
                            '" width="308px">&nbsp;&nbsp;&nbsp;';

SELECT * FROM `profile` WHERE `user_id`=1
---
                </div>
                <div class="col-lg-7">
                    <h4>
                        <p><strong><span class="info"><?= $model->getProfile()->one()->name ?></span></strong>