common/models/User.php

SELECT * FROM `user` WHERE (`email`='admin@admin.com') AND (`status`=10)
---
    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email, 'status' => self::STATUS_ACTIVE]);

UPDATE `user` SET `password_hash`='$2y$13$KD2CaqRgTKSf2AYzZ6Zl4eK4xdwySUVJgUYJ94kjZdIMVg/s2ibLq', `updated_at`=1468764195 WHERE `id`=2
---
    public function updateUser(User $user)
    {
        if(!$this->validate()){
          return null;
        }

        $this->email = $user->email;

        if (isset($user->newPassword) && strlen($user->newPassword) > 5) {
            $this->setPassword($user->newPassword);
        }
        return $this->save() ? true : false;