frontend/views/layouts/main.php

SELECT * FROM `profile` WHERE `user_id`=2
SELECT * FROM `user` WHERE `id`=2
---
//        ['label' => 'Contact', 'url' => ['/site/contact']],
    ];
    if (!Yii::$app->user->isGuest) {
            $username = User::findOne(Yii::$app->user->id)->getProfile()->one()->name;