frontend/models/Files.php

    public function updateFile($file)
    {
        if (!$this->validate()) {
            return false;
        }

        $file->path = $this->path;
        return $file->save() ? $file : false;
---
INSERT INTO `files` (`status`, `path`) VALUES (10, 'uploads/pictures/worlds/avatars/1468353250newTestWorld_3.jpg')