frontend/models/Profile.php

    public function deleteAvatar ()
    {
        if (!isset($this->avatar)) {
            return false;
        }
        if (!Files::findOne(['id' => $this->avatar])->deleteFile()){
            return false;
        }
        $this->avatar = null;
        return $this->save() ? true : false;
---
UPDATE `profile` SET `birthday`='30.01.2011', `updated_at`=1467699419 WHERE `id`=2