frontend/models/World.php

UPDATE `world` SET `file_id`=52, `updated_at`=1468353250 WHERE `id`=18
---
    public function deleteAvatar()
    {
        if (!isset($this->file_id)) {
            return false;
        }
        if (!Files::findOne(['id' => $this->file_id])->deleteFile()) {
            return false;
        }
        $this->file_id = null;
        return $this->save() ? true : false;