frontend/models/World.php

    public function updateWorld($world)
    {
        if (!$this->validate()) {
            return null;
        }

        $world->user_id = Yii::$app->user->id;
        $world->name = $this->name;
        $world->file_id = $this->file_id;
        $world->description = $this->description;

        return $world->save() ? $world : false;
---
INSERT INTO `world` (`name`, `description`, `status`, `file_id`, `user_id`, `created_at`, `updated_at`) VALUES ('newTestWorld', '', 10, 48, 2, 1468092104, 1468092104)

    public function deleteWorld()
    {
        $this->name .= '-deleted' . $this->id;
        $this->status = self::STATUS_DELETED;
        return $this->save() ? true : false;
---
UPDATE `world` SET `name`='newTestWorld 5-deleted13', `status`=0, `updated_at`=1468086771 WHERE `id`=13