frontend/views/site/index.php

SELECT * FROM `world` WHERE `status`=10
---
        'label' => 'Создать',
        'icon' => 'plus',
    ];
    $model = $model->findAll(['status' => World::STATUS_ACTIVE]);